import 'package:flutter/material.dart';
import 'package:najran/widgets/najran_scaffold.dart';

class MudHouses extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    final screenHeight = MediaQuery.of(context).size.height;

    return NajranScaffold(
      title: 'البيوت الطينية',
      currentIndex: 3,
      child: SingleChildScrollView(
        child: Column(
          children: [
            // Partie haute avec image de fond et texte (25% de l'écran)
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: ClipRRect(
                borderRadius: BorderRadius.circular(12), // Coins arrondis
                child: Image.asset(
                  'assets/images/mud_houses.png',
                  height: screenHeight * 0.25,
                  width: double.infinity,
                  fit: BoxFit.cover,
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  Text(
                    'البيت الطيني',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'يجسد التراث العمراني في منطقة نجران إرثًا تاريخيًا جغرافيًا واجتماعيًا، تتجلى فيه البيوت والقصور الطينية التي بقيت شواهد للعصر، لما كان يتمتع به أهالي المنطقة السابقين من حس فني، وتخطيط هندسي معماري فريد يبرز الهوية العمرانية للمنطقة، ويجذب السياح والزوار للتعرف على تاريخ وحضارة المجتمع القديمة.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'ويعتبر " الطين والحجر والأخشاب " هي المواد الأساسية في بناء البيت الطيني وتعتمد في بنائها على إحدى طريقتين فإما أن يكون البيت مستطيل على ارتفاع شاهق يضيق من كل جوانبه كلما ارتفع وتعد قاعدته أعرض من قمته, أو يكون مستطيلاً أو مربعاً لا تتخلله انكسارات ويبدو شكلاً متوازناً في العرض بين القمة والقاعدة وتبدأ مرحلة البناء بالفكرة التقليدية العامة التي تفرض اختيار الموقع المناسب للبناء سواءً كان في أرض زراعية يغذيها بالماء وادي نجران أو يكون في مكان مناسب يجعل من البيت قلعة ذات موقع مهم إن وقعت حروب أو ما شابه أو كان موقع البيت في أي صورة أخرى يختارونها من قبل .ثم يضعون خيط بشكل هندسي على موقع البناء يحفر في وسطه ما يقارب المترين لكي يوضع بها ما يسمى بــ " الوثر" وهو من الحجارة والطين يرصّ فيما يسمى " المدماك" الذي تجمع فيه الحجارة والطين والماء داخل إطاره المستطيل وتترك لفترة يوم أو يومين تزيد هذه المدة في الشتاء وتقل في الصيف. لتتم بعدها عملية " الصماخ" في مرحلتها الأولى التي تمثل إعطاء الوجه الخارجي للجدران السفلية التي تم بناؤها .',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'أما سقف بيوت الطين في نجران فإنها تتخذ من جذوع النخل وشجر الأثل والسدر التي تنمو في بيئة نجران بكثرة وتزين بسعف النخل أحياناً وبعد أن تمر فترة بين 10 و 20 يوم يتم وضع الجير الأبيض الذي يثبت أركان وزوايا البيت ويسمى " القضاض" وتعود بعد ذلك المرة الثانية من "الصماخ" ويتم إعطاء الوجه الطيني الأخير للجدران سواء من الخارج أو الداخل وتبدأ مرحلة بناء الدرج "التعسيف" التي تترك لبيت الطين شكلاً يدل على دقة البناء والتخطيط للبيت. وبعدها تتم إضافات جمالية على إطار البيت الاعلى يتم تلوينه بألوان بيضاء متخذاً أشكال هندسية دقيقة تستخدم فيها قوالب خشبية وكذلك أشكال داخلية على الأبواب وعلى جدران البيت الداخلي.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'وقد تكون بعض الأعمال التي تعتبر في المرحلة النهائية هي من أجل حفظ الأغراض ومنها ما يسمى بــ"الكوة" التي توضع فيها الكتب والمصابيح. وقد تتم صناعة "الدكة" وهي موقع مرتفع قليلاً يجلس عليه الزوار وكبار السن. كما يوضع "الصفيف" وهو الذي يوضع الأكل فوقه. كما يبنى في الخارج على حدود البيت الطيني النجراني ما يسمى ب"الحذوة" وهي من الحجارة والطين وتهدف لحماية البيت من الماء والملوحة وعوامل التعرية الطبيعية. وتعتبر آخر خطوة في بناء البيت النجراني أو الإسم الذي يطلقه أهل نجران عليه "الدرب".',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 20),
                ],
              ),
            ),
          ],
        ),
      ),
    );
  }
}
