import 'package:flutter/material.dart';
import 'package:najran/widgets/carousels/carousel.dart';
import 'package:najran/widgets/najran_scaffold.dart';

class RegionInfoScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    final screenHeight = MediaQuery.of(context).size.height;

    return NajranScaffold(
      title: 'منطقة نجران',
      currentIndex: 3,
      child: SingleChildScrollView(
        child: Column(
          children: [
            // Partie haute avec image de fond et texte (25% de l'écran)
            Padding(
              padding: const EdgeInsets.all(16.0),
              child: ClipRRect(
                borderRadius: BorderRadius.circular(12), // Coins arrondis
                child: Image.asset(
                  'assets/images/najran.jpg',
                  height: screenHeight * 0.25,
                  width: double.infinity,
                  fit: BoxFit.cover,
                ),
              ),
            ),

            // 🔽 Suite du contenu scrollable ici :
            Padding(
              padding: const EdgeInsets.all(16.0),
              child: Column(
                crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  Text(
                    'نبذة عن منطقة نجران',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'حبا الله سبحانه وتعالى منطقة نجران الواقعة في الجنوب الغربي من المملكة العربية السعودية بمقومات سياحية متميزة وموقع استراتيجي كواجهة على طرق الصحراء ومناخ معتدل صيفا وشتاء، ومنطقة نجران التي تعد رابع منطقة سعودية من حيث المساحة ( 360 ألف كلم مربع ( تشتمل على ثلاث بيئات جغرافية منطقة سهلية خصبة تقع في وسط نجران وتمثل الثقل التاريخي والبشري وتضم العديد من الأودية وأشهرها وادي نجران ومنطقة جبلية في الغرب والشمال وتضم العديد من المنتزهات الجميلة وأشجار السدر والآثار التاريخية العريقة ومنطقة رملية في الشرق وهي جزء من صحراء الربع الخالي.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'الموقع:',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    ' تقع منطقة نجران في الجنوب الغربي من المملكة العربية السعودية بين خطي عرض 17 و 20 درجة شمالا وخطي طول 944 52 درجة شرقا ويحدها من الشرق صحراء الربع الخالي ومن الغرب منطقة عسير ومن الشمال منطقة الرياض ومن الجنوب جمهورية اليمن ويتبع لمنطقة نجران ست محافظات هي: محافظة شروره محافظة حبونا، محافظة ثار، محافظة يدمه، محافظة بدر الجنوب، محافظة خباش.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'عدد السكان:',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    ' يقدر عدد سكان منطقة نجران حوالي 592.300 نسمة، وقد حضت كغيرها من المناطق بنصيب وافر من التطور في جميع المجالات كالعمرانية والزراعية والمدية منوها من الخدمات التي مضتها حكومة خادم الحرمين الشريفين اihanl. 15. مكان حيث هيأت المرش. الكريم والحياة المائئة الضارة في ذا. الأمن والأمان السائدين بفضل تحكيم الشريعة والتمسك بمبادئها.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'المناخ:',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    ' تمتاز نجران بمناخ معتدل شتاء ذي رطوبة متوسطة، شديد البرودة في المناطق الجبلية، ومعتدل الحرارة صيفا أما الأمطار فهي متوسطة شتاءا وغزيرة صيفا اغلب الأحيان وتبعا لتباين الارتفاعات فان درجات الحرارة تتفاوت حيث تتراوح بين 14 وحتى 36 درجة مئوية.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'حضارات المنطقة: ',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    '1.المرحلة الأولى:',
                    style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'بدأت قبل أكثر من (1.5) مليون سنة من الوقت الحاضر واستمرت حتى حوالي 2000ق.م وتعرف بحضارة العصر الحجري.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    '2.المرحلة الثانية:',
                    style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'بدأت قبل سنة (1000) ق.م وشهدت نشأة مدينة نجران القديمة وازدهار التجارة البرية التي ساهمت في نشأة العديد من المدن التجارية الأخرى في أنحاء الجزيرة العربية خلال الألف الأول ق.م حيث أصبحت نجران خلال الفترة من 600ق.م إلى 300ق.م من ابرز المدن التجارية المميزة لحضارة جنوب الجزيرة العربية وكانت تقوم على نفس موقع الأخدود الحالي .',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    '3.المرحلة الثالثة:',
                    style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'بدأت بحلول عام 300ق.م وانتهت بحلول فجر الإسلام وتعرف بالفترة البيزنطية وتمثلت في شمال شرق الموقع شمال شرق القلعة وكانت حادثة الأخدود ابرز حادثة في تلك الفترة حيث كانت نجران تشكل جزء من اتحاد سياسي يضم إلى جانبها دولة كنده بزعامة الدولة الحميرية. وكانت البداية المتبعة آنذاك المسيحية التي انتشرت في نجران وآمن بها الناس مما سبب في وقوع حادثة الأخدود كما أسلفنا.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    '4.المرحلة الرابعة:',
                    style: TextStyle(
                      fontSize: 20,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'المرحلة الإسلامية والتي بدأت في السنة التاسعة والعاشرة للهجرة حيث لم يعد للأخدود مكان التجمع الرئيسي في نجران وإنما انتشر العيش خارج الموقع في أنحاء متفرقة من الوادي، حيث تذكر المصادر التاريخية أن نجران قبل الإسلام بقليل في فجر الإسلام كانت سوق من أسواق العرب المشهورة واستمرت المدينة آهلة بالسكان حتى القرن الرابع الهجري حيث يوجد دلائل أثرية في المتحف تشير إلى أن الاستيطان في نجران لم يتوقف والأرجح أنه استمر حتى الوقت الحاضر. ',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    ' الأهمية الاقتصادية قديماً :',
                    style: TextStyle(
                      fontSize: 24,
                      fontWeight: FontWeight.w900,
                      color: Color(0xFF1B8354),
                    ),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'احتلت نجران قديما وعلى مر التاريخ موقعا هاما من الناحية الاقتصادية بين شمال وغرب الجزيرة العربية وجنوبا أيضا خاصة في فترة ( 400- 450 عاما قبل الميلاد حيث كانت تتميز بموقعها مثل دولة سبأ ومعين وقطبان وحضرموت وأفادها في ذلك الشيء موقعها الإستراتيجي حيث كانت تعتبر ممرا لقبائل غرب',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  SizedBox(height: 8),
                  Text(
                    'ووسط الجزيرة العربية. وتعد مدينة الأخدود الأثرية شاهدا على تلك الفترة المهمة حيث كانت مركزا للتجارة القديمة مرورا بطريق التجارة القديم. واشتهرت نجران بسلعها الجيدة التي كانت تصل إليها من جنوب الجزيرة العربية ومن الهند كاللبان والمر والبخور وغيرها ويتم تصديرها عن طريق خط التجارة القديم المار بحمى شمال نجران حيث تتجمع القوافل به وتتفرع إلى فرعين الأول يتجه بشمال شرق الجزيرة العربية مارا بقرية آلفو وصولا إلى بلاد ما بين النهرين والثاني يتجه إلى شمال وشرق الجزيرة العربية مارا بجرش ثم مكة المكرمة والمدينة المنورة والعلا ثم البتر وبلاد الشام ونهر النيل حيث كانت المعابد المصرية تعتمد على صادرات جنوب الجزيرة العربية من اللبان والبخور في ممارسة بعض الطقوس الدينية.',
                    style: TextStyle(fontWeight: FontWeight.w600),
                  ),
                  CarouselExample(),
                  SizedBox(height: 20),
                ],
              ),
            ),
          ],
        ),
      ),
    );
  }
}
