import 'package:flutter/material.dart';
import 'package:flutter_svg/svg.dart';
import 'package:najran/config/config.dart';
import 'package:najran/services/auth_service.dart';
import 'package:najran/widgets/najran_scaffold.dart';
import 'package:url_launcher/url_launcher.dart';

class ServiceModel {
  final String title;
  final List<String> conditions;
  final List<String>? documents;
  String? guideId;

  ServiceModel({
    required this.title,
    required this.conditions,
    this.documents,
    this.guideId,
  });

  String? get pdfUrl {
    if (guideId == null) return null;
    return "/web/content/$guideId?download=true";
  }
}

class ProceduresGuide extends StatefulWidget {
  const ProceduresGuide({super.key});

  @override
  State<ProceduresGuide> createState() => _ServicePageState();
}

class _ServicePageState extends State<ProceduresGuide> {
  final OdooApiService _odooService = OdooApiService();

  final services = [
    ServiceModel(
      title: "طلب زواج مواطن سعودي بأجنبية",
      conditions: [
        "قم بالدخول إلى البوابة الوطنية للتسجيل الموحد عبر منصة بلدي.",
        "اختيار خدمات تراخيص البناء، ثم إصدار البناء.",
        "خدمات الترخيص ثم البلدية المطلوبة.",
        "اختيار المكتب الهندسي، ثم إدخال رقم وسنة إصدار مسح البناء، وإرفاق نسخة من السند.",
        "تقديم الطلب إلى المكتب الهندسي المحدد، ثم استكمال المعلومات والمرفقات في المكتب الهندسي وإرسالها إلى البلدية.",
        "التأكد من بيانات الطلب والمرفقات والموافقات من قبل البلدية.",
        "الموافقة على الطلب وإصدار دفعة سداد. دفع الرسوم وطباعة الرخصة.",
      ],
      documents: [
        "قم بالدخول إلى البوابة الوطنية للتسجيل الموحد عبر منصة بلدي.",
        "اختيار خدمات تراخيص البناء، ثم إصدار البناء.",
        "خدمات الترخيص ثم البلدية المطلوبة.",
        "اختيار المكتب الهندسي، ثم إدخال رقم وسنة إصدار مسح البناء، وإرفاق نسخة من السند.",
        "تقديم الطلب إلى المكتب الهندسي المحدد، ثم استكمال المعلومات والمرفقات في المكتب الهندسي وإرسالها إلى البلدية.",
        "التأكد من بيانات الطلب والمرفقات والموافقات من قبل البلدية.",
        "الموافقة على الطلب وإصدار دفعة سداد. دفع الرسوم وطباعة الرخصة.",
      ],
      guideId: "marry_foreign_woman",
    ),
    ServiceModel(
      title: "	طلب زواج مواطنة سعودية بأجنبي",
      conditions: [
        " أن لا تكون طالبة الزواج السعودية من الفئات المشمولة بالمنع",
        "ان لا يقل سنة صاحبة الطلب عن (25) عام ولا يزيد عن (50) عام",
        "إذا كانت المرأة السعودية ابنة عم الخاطب أو ابنة خاله من الدرجة الأولى فلا يقل عمرها عن (21) عام",
        "ان لا يكون فرق العمر بين طرفي الزواج عن (15) عام",
        "أن تكون المتقدمة من سكان منطقة نجران وتثبت سكنها بتعريف من عملها أو تعريف من عمدة الحي",
        "موافقة ولي أمر المرأة السعودية أو وكيله الشرعي",
        " أن يكون الخاطب الأجنبي لديه إقامة نظامية ومصرح له بالعمل وأن يكون عربياَ مسلماً",
        "خلو الطرف الأجنبي من الأمراض المشمولة بقرار مجلس الوزراء رقم 156",
        "خلو صحيفة الأدلة الجنائية للطرف الأجنبي من أي تطابق جنائي",
        "أن لا يكون الخاطب الأجنبي سبق له الزواج من امرأة سعودية أو مطلق لامرأة سعودية",
        "إذا كان الخاطب الأجنبي لديه زوجة أجنبية فيجب عدم إقامتها داخل المملكة",
        "حضور المتقدمة برفقة ولى أمرها لتعبئة الاستمارة والإقرار ونموذج التعريف الخاصين بطلب الزواج من غير سعودي وتوقيع إقرار موافقته أمام الموظف المختص",
        "أن تكون جميع الأوراق المطلوبة بتاريخ حديث",
      ],
      documents: [
        "المخطوبة :",
        "استدعاء يقدم من ولى أمر المرأة السعودية للمحافظة المقيم بها أو مركز الإمارة التابع له",
        "صورة الهوية الوطنية للمرغوب الزواج بها سارية المفعول أو سجل الأسرة المضافة به",
        "سجل الحاسب الآلي من الأحوال المدنية (برنت) ومراعاة أن تكون المهنة مطابقة للواقع",
        "إذا كانت المتقدمة (موظفة حكومية) إرفاق تعريف من جهة عملها يشتمل على معلومات عن مقر عملها ومسمى وظيفتها ومرتبتها ومقدار راتبها",
        "إذا كانت المتقدمة (موظفة أهلية) إرفاق تعريف من جهة عملها مصادق عليه من الغرفة التجارية",
        " إذا كانت المتقدمة (طالبة) إرفاق تعريف من الجهة التي تدرس بها",
        "إذا كان المتقدمة (ربة منزل ) إرفاق مشهد بعدم وجود عمل مصدق من العمدة والشرطة",
        "إذا كانت المتقدمة سبق لها الزواج (مطلقة أو أرملة ) فيجب إرفاق صورة من صك الطلاق أو صورة من شهادة وفاة الزوج",
        "تقرير طبي ما قبل الزواج من المختبر الإقليمي",
        "الخاطب:",
        "صورة إقامة المقيم وصورة جواز سفره ساريتا المفعول وهدم مقاربتها على الانتهاء",
        "برنت تحقيق شخصية مقيم من الجوازات",
        "شهادة تعريف بالعمل موضح فيها مقدار الراتب مصادق عليها من الغرفة التجارية",
        "إقرار بأنه لم يسبق له الزواج من امرأة سعودية أو مطلق لامرأة سعودية",
        " في حال كان متزوج من غير سعودية فيرفق صورة عقد النكاح وإذا كان مطلق أو زوجته متوفاة فيرفق صورة من صك الطلاق أو صورة من شهادة وفاة الزوجة",
        "صحيفة خلو سوابق من الأدلة الجنائية في المملكة",
        "شهادة خلو سوابق من بلد الخاطب مصادق عليها من سفارة المملكة في بلده ومن وزارة الخارجية في المملكة",
        "فحص تحليل المخدرات ويشترط أن تكون النتيجة (سلبية)",
        "تقرير طبي ما قبل الزواج من المختبر الإقليمي",
      ],
      guideId: "marry_foreign_man",
    ),
    ServiceModel(
      title: "طلب زواج مواطن سعودي بأجنبية من مواليد المملكة",
      conditions: [
        "أن لا يكون طالب الزواج السعودية من الفئات المشمولة بالمنع.",
        "إذا كانت المخطوبة ابنة مواطنة وتحمل شهادة ميلاد سعودية التوجه مباشرة إلى كتابة العدل.",
        "أن تكون المخطوبة من مواليد المملكة ويثبت ذلك بشهادة ميلاد صادرة من الأحوال المدنية أو الشئون الصحية مصادق على صحتها من الجهة التي أصدرتها.",
        "أن لا يقل سن صاحب الطلب (25) عام إلا إذا كانت المخطوبة ابنة عم الخاطب أو ابنة خاله من الدرجة الأولى فيستثنى إلى من دون (21) عام ولا يقل عمر المرأة الأجنبية عن (18) عام.",
        "أن لا يزيد سن صاحب الطلب عن (70) عام.",
        "يستثنى من الحد الأدنى للعمر من كان لديه زوجة متوفاة أو مطلقة بحيث يكون مضى على تاريخ الطلاق ستة أشهر أو يكون المواطن السعودي مصاب بمرض أو عاهة وثبت ذلك بتقرير طبي.",
        "إذا كان المتقدم لديه زوجة بعصمته فيجب إحضار تقرير طبي (مترجم) من مستشفى حكومي أو من مستشفى خاص مصادق عليه من الشئون الصحية يفيد بأنها تعاني من عدم القدرة على الإنجاب أو مصابة بمرض يحول دون المعاشرة الزوجية.",
        "أن يكون المتقدم من سكان منطقة نجران ويثبت سكنه بتعريف من جهة عمله أو تعريف من عمدة الحي كذلك (عقد الإيجار أو صك ملكية).",
        "أن تكون المخطوبة تقيم بهوية مقيم أو تأشيرة زيارة سارية الصلاحية.",
        "موافقة ولي أمر المخطوبة أو وكيله الشرعي.",
        "خلو الطرف الأجنبي من الأمراض المشمولة بقرار مجلس الوزراء رقم 156.",
        "في حال كانت جنسية المرأة الأجنبية من (مصر أو المغرب أو سوريا أو أوزباكستان) فيؤخذ إقرار على مقدم الطلب باطلاعه على التعليمات المنظمة للزواج من تلك الدول.",
        "حضور المتقدم لتعبئة الاستمارة والإقرار ونموذج التعريف الخاصين بطلب الزواج من غير سعودية.",
        "حضور ولي أمر المرأة لتوقيع إقرار الموافقة أمام الموظف المختص.",
        "حضور طرفي الزواج لتعبئة نماذج البيانات الشخصية (المسح الأمني).",
        "أن تكون جميع الأوراق المطلوبة بتاريخ حديث.",
      ],
      documents: [
        "الخاطب:",
        "استدعاء يقدم من صاحب الطلب السعودي للمحافظة المقيم بها أو مركز الإمارة التابع له.",
        "صورة الهوية الوطنية سارية المفعول.",
        "صورة سجل الأسرة إذا كان المتقدم متزوجا وفي حال سبق له الطلاق يراعى إسقاط اسم المرأة المطلقة وإرفاق صورة من صك الطلاق.",
        "سجل الحاسب الآلي من الأحوال المدنية (برنت) ومراعاة أن تكون المهنة مطابقة للواقع.",
        "تعريف من جهة عمل المتقدم يشتمل على معلومات عن مقر عمله ومسمى وظيفته ومرتبته ومقدار راتبه.",
        "إذا كان المتقدم (موظف أهلي) إرفاق تعريف من جهة عمله مصادق عليه من الغرفة التجارية.",
        "إذا كان المتقدم (طالب) إرفاق تعريف من الجهة التي يدرس بها.",
        "إذا كان المتقدم يعمل لحسابه الخاص (متسبب) إرفاق شهادة من المؤسسة العامة للتقاعد وبرنت من المؤسسة العامة للتأمينات الاجتماعية تثبت عدم تسجيله لديهم ومشهد بعدم وجود عمل مصدق من العمدة والشرطة.",
        "تقرير طبي ما قبل الزواج من المختبر الإقليمي.",
        "المخطوبة:",
        "صورة إقامة المرأة أو تأشيرة الزيارة وصورة جواز سفرها سارية المفعول وعدم مقاربتها على الانتهاء.",
        "صورة هوية ولي أمر المرأة وإذا كان وليها غير والدها فترفق صورة من صك الولاية أو وكالة تخول الولي بالسماح للمرأة بالزواج.",
        "برنت تحقيق شخصية مقيم من الجوازات.",
        "إذا كانت المرأة سبق لها الزواج (مطلقة - أرملة) فيجب إرفاق صورة من صك الطلاق أو صورة من شهادة وفاة الزوج.",
        "صورة شهادة الميلاد السعودية مصادق على صحتها من الجهة التي أصدرتها (الأحوال المدنية أو الشئون الصحية).",
        "تقرير طبي ما قبل الزواج من المختبر الإقليمي.",
      ],
      guideId: "marry_woman_born_in_sa",
    ),
    ServiceModel(
      title: "طلب زواج مواطنة سعودية بأجنبي من مواليد المملكة",
      conditions: [
        "أن لا تكون طالبة الزواج السعودية من الفئات المشمولة بالمنع.",
        "أن يكون الطرف الأجنبي من مواليد المملكة ويثبت ذلك بشهادة ميلاد صادرة من الأحوال المدنية أو الشئون الصحية مصادق على صحتها من الجهة التي أصدرتها.",
        "أن لا يقل سن صاحبة الطلب عن (21) عامًا ولا يزيد عن (50) عامًا. إذا كانت المرأة السعودية ابنة عم الخاطب أو ابنة خاله من الدرجة الأولى فلا يقل عمرها عن (18) عامًا.",
        "أن لا يكون فرق العمر بين طرفي الزواج أكثر من (15) عامًا.",
        "أن تكون المتقدمة من سكان منطقة نجران وتثبت سكنها بتعريف من جهة عملها أو تعريف من عمدة الحي.",
        "موافقة ولي أمر المرأة السعودية أو وكيله الشرعي.",
        "أن يكون الخاطب الأجنبي لديه إقامة نظامية ومصرح له بالعمل وأن يكون عربيًا مسلمًا.",
        "خلو الطرف الأجنبي من الأمراض المشمولة بقرار مجلس الوزراء رقم 156.",
        "خلو صحيفة الأدلة الجنائية للطرف الأجنبي من أي تطابق جنائي.",
        "أن لا يكون الخاطب الأجنبي سبق له الزواج من امرأة سعودية أو مطلق امرأة سعودية.",
        "إذا كان الخاطب الأجنبي لديه زوجة أجنبية فيجب عدم إقامتها داخل المملكة.",
        "حضور المتقدمة برفقة ولي أمرها لتعبئة الاستمارة والإقرار ونموذج التعريف الخاصين بطلب الزواج من غير سعودي وتوقيع إقرار موافقته أمام الموظف المختص.",
        "حضور طرفي الزواج لتعبئة نماذج البيانات الشخصية (المسح الأمني).",
        "أن تكون جميع الأوراق المطلوبة بتاريخ حديث.",
      ],

      documents: [
        "المخطوبة :",
        "استدعاء يقدم من ولي أمر المرأة السعودية للمحافظة المقيم بها أو مركز الإمارة التابع له.",
        "صورة الهوية الوطنية للمرغوب الزواج بها سارية المفعول أو سجل الأسرة المضافة به.",
        "سجل الحاسب الآلي من الأحوال المدنية (برنت) ومراعاة أن تكون المهنة مطابقة للواقع.",
        "إذا كانت المتقدمة (موظفة حكومية ) إرفاق تعريف من جهة عملها يشتمل على معلومات عن مقر عملها ومسمى وظيفتها ومرتبتها ومقدار راتيها.",
        "إذا كان المتقدمة (موظفة أهلية) إرفاق تعريف من جهة عملها مصادق عليه من الغرفة التجارية.",
        "إذا كان المتقدمة (طالبة) إرفاق تعريف من الجهة التي تدرس بها.",
        "إذا كان المتقدمة (ربة منزل) إرفاق مشهد بعدم وجود عمل مصدق من العمدة والشرطة.",
        "إذا كانت المتقدمة سبق لها الزواج (مطلقة - أرملة) فيجب إرفاق صورة من صك الطلاق أو صورة من شهادة وفاة الزوج.",
        "تقرير طبي ما قبل الزواج من المختبر الإقليمي.",

        "الخاطب :",
        "صورة الإقامة وصورة جواز السفر سارينا المفعول وعدم مقاربتهما على الانتهاء.",
        "صورة شهادة الميلاد السعودية مصادق على صحتها من الجهة التي أصدرتها (الأحوال المدنية أو الشئون الصحية).",
        "برنت تحقيق شخصية مقيم من الجوازات.",
        "شهادة تعريف بالعمل موضح فها مقدار الراتب مصادق عليها من الغرفة التجارية.",
        "إقرار بأنه لم يسبق له الزواج من امرأة سعودية أو مطلق الامرأة سعودية.",
        "في حال كان متزوج من غير سعودية فيرفق صورة عقد النكاح وإذا كان مطلق أو زوجته متوفاة فيرفق صورة من صك الطلاق أو صورة من شهادة وفاة الزوجة.",
        "صحيفة خلو سوابق من الأدلة الجنائية في المملكة.",
        "شهادة خلو سوابق من بلد الخاطب مصادق عليها من سفارة المملكة في بلده ومن وزارة الخارجية في المملكة.",
        "فحص تحليل المخدرات ويشترط أن تكون النتيجة (سلبية).",
        "تقرير طبي ما قبل الزواج من المختبر الإقليمي.",
      ],

      guideId: "marry_man_born_in_sa",
    ),
    ServiceModel(
      title: "طلب توثيق زواج",
      conditions: [
        "أن لا يكون طالب/ة توثيق الزواج السعودي/ة من الفئات المشمولة بالمنع",
        " يجب أن يكون هناك إثبات رسمي الأطراف توثيق الزواج السعودي والأجنبي",
        " أن يكون مضى على الزواج (5) سنوات) لمن أنجبت له، و (7) سنوات) لمن أنجبت له ولديه زوجة سعودية غيرها و (10 سنوات) لمن لم تنجب له",
        " مناقشة الطرف السعودي - المرأة بحضور ولي - أمرها في دفتر الاستدلال من جهة الاختصاص عن أسباب زواجها من غير سعودي/ة بدون إذن مسبق",
        "مشهد من عقد الزواج فإن لم يجد فمشهد من شاهدين بمصادقة العمدة والشرطة موضح فيه تاريخ واقعة الزواج باليوم والشهر والسنة",
        "صور شهادات ميلاد الأولاد فإن لم يجد فمشهد من شاهدين بمصادقة العمدة والشرطة موضح فيه تاريخ واقعة الإنجاب باليوم والشهر والسنة",
        "مشهد بعمل الطرف السعودي قبل وبعد الزواج",
        "مشهد بعدد الزوجات اللاتي بعصمة الزوج السعودي",
        "أن يكون الطرف السعودي من سكان منطقة نجران ويثبت سكنه بتعريف من جهة عمله أو تعريف من عمدة الحي كذلك ( عقد الإيجار أوصك ملكية)",
        "أن يكون الزوج الأجنبي يحمل إقامة نظامية وجواز سفر سارينا الصلاحية أما الزوجة الأجنبية ففي حال عدم وجود إقامة فيكتفى بصورة من جواز سفرها ساري المفعول وإيضاح صفة إقامتها داخل المملكة",
        "حضور الطرف السعودي لتعبئة الإقرار ونموذج التعريف الخاصين بطلب توثيق الزواج من غير سعودي/ة",
        "حضور طرفي توثيق الزواج لتعبئة نماذج البيانات الشخصية (المسح الأمني)",
        "أن تكون جميع الأوراق المطلوبة بتاريخ حديث",
      ],
      documents: [
        "الطرف السعودي :",
        "استدعاء يقدم من صاحب الطلب السعودي – ولي أمر المرأة السعودية – للمحافظة المقيم بها أو مركز الإمارة التابع له.",
        "صورة الهوية الوطنية سارية المفعول.",
        "صورة سجل الأسرة إذا كان الزوج السعودي متزوجا وفي حال سبق له الطلاق يراعى إسقاط اسم المرأة المطلقة وارفاق صورة من صك الطلاق.",
        "سجل الحاسب الآلي من الأحوال المدنية (برنت) ومراعاة أن تكون المهنة مطابقة للواقع.",
        "عقد النكاح (إن وجد).",
        "شهادات ميلاد الأولاد (إن وجد).",
        "إذا كان الطرف السعودي موظف حكومي إرفاق تعريف من جهة العمل يشتمل على معلومات عن مقر العمل ومسمى الوظيفة والمرتبة ومقدار الراتب.",
        "إذا كان الطرف السعودي يعمل في (قطاع خاص) إرفاق تعريف من جهة العمل مصادق عليه من الغرفة التجارية.",
        "إذا كان الطرف السعودي (طالب) إرفاق تعريف من الجهة التي يدرس بها.",

        "الزوج الأجنبي :",
        "صورة الإقامة وجواز السفر ساريا الصلاحية.",
        "برنت تحقيق شخصية مقيم من الجوازات.",
        "صورة شهادة الميلاد السعودية مصادق على صحتها من الجهة التي أصدرتها (الأحوال المدنية أو الشئون الصحية) في حال كان من مواليد المملكة.",
        "شهادة تعريف بالعمل موضح فيها مقدار الراتب مصادق عليها من الغرفة التجارية.",
        "إقرار بأنه لم يسبق له الزواج من امرأة سعودية أو مطلق امرأة سعودية.",
        "في حال كان متزوج من غير سعودية فيرفق صورة عقد النكاح وإذا كان مطلقًا أو زوجته متوفاة فيرفق صورة من صك الطلاق أو صورة من شهادة وفاة الزوجة.",
        "صحيفة خلو سوابق من الأدلة الجنائية في المملكة.",
        "شهادة خلو سوابق من بلد الخاطب مصادق عليها من سفارة المملكة في بلده ومن وزارة الخارجية في المملكة.",
        "الزوجة الأجنبية :",
        "صورة الإقامة (إن وجدت) أو يكتفى بصورة جواز السفر ساري المفعول.",
        "صورة شهادة الميلاد السعودية مصادق على صحتها من الجهة التي أصدرتها (الأحوال المدنية أو الشئون الصحية) في حال كانت من مواليد المملكة.",
      ],

      guideId: "legalize_marriage",
    ),
    ServiceModel(
      title: "طلب إعفاء من باقي محكومية",
      conditions: [
        "بيانات مقدم الطلب",
        "تقديم استدعاء لمقام الامارة",
        "تعبئة البيانات المطلوبة ( اسم السجين-رقم هوية السجين-اسم السجن -نوع القضية )",
        "تفاصيل الطلب وإرفاق المستندات المثبتة لصحة ذلك",
        "صك الحكم النهائي",
      ],
      documents: ["وثيقة 1", "وثيقة 2"],
      guideId: 'exemption_from_rest_convict',
    ),
    ServiceModel(
      title: "طلب نقل سجين",
      conditions: [
        "بيانات مقدم الطلب",
        "تقديم استدعاء لمقام الامارة",
        "تعبئة البيانات المطلوبة ( اسم السجين-رقم هوية السجين-اسم السجن - مكان السجين الحالي – مكان السجين المراد النقل اليه – اثبات سكن ذوي السجين في المنطقة المراد النقل اليه )",
        "تفاصيل الطلب وإرفاق المستندات المثبتة لصحة ذلك",
        "صورة الهوية الوطنية لمقدم الطلب",
        "صك الحكم النهائي",
      ],
      guideId: "prisoner_transfer",
    ),
    ServiceModel(
      title: "إعفاء من الاستبعاد",
      conditions: [
        "بيانات مقدم الطلب",
        "تقديم استدعاء لمقام الامارة",
        "صورة الإقامة لمقدم الطلب",
        "أن يكون حكمه مميز (من محكمة التمييز)",
        "أن يكون حكمه أقل من (10 سنوات)",
        "تقديم تعهد",
        "ان تكون إقامة سارية",
        "صك الحكم النهائي",
      ],

      guideId: 'exemption_exclusion',
    ),
    ServiceModel(
      title: "طلب موعد",
      conditions: [
        "بيانات مقدم الطلب (الاسم، رقم الهوية)",
        " ارفاق صورة من هوية مقدم الطلب",
        " ارافاق خطاب سبب الزيارة",
      ],
      documents: [
        "توضيح سبب الزيارة",
        "خطاب موضوع الزيارة",
        "ارفاق صورة من هوية مقدم الطلب",
      ],
      guideId: "appointment_request",
    ),
    ServiceModel(
      title: "طلب ترحيل جثمان",
      conditions: [
        "بيانات مقدم الطلب (الاسم، رقم الهوية)",
        "عنوان ذويه في المملكة وفي بلده",
        "تحديد مسار الرحلة",
        "تحديد مكان وجود الجثمان",
        " رقم تأشيرة الدخول",
      ],
      documents: [
        " تقديم استدعاء",
        "صورة اقامة المتوفى",
        "ارفاق صورة من هوية مقدم الطلب",
        "ارفاق جواز سفر المتوفى أو صورة منها",
        "موافقة سفارة بلده لترحيله",
        "ارفاق شهادة الوفاة",
        "تحديد مسار الرحلة",
      ],
      guideId: "deceased_transfer",
    ),
    ServiceModel(
      title: "طلب تعويض الأضرار",
      conditions: [
        "ان يكون من سكان منطقة نجران او احدى مراكزها",
        "ان يكون سعودي الجنسية",
        "أن لا يكون لدى مقدم الطلب معاملة سابقة بنفس الموضوع تحت الاجراء",
      ],
      documents: [
        "تقديم استدعاء لمقام الامارة",
        "إرفاق صورة اثبات تملك العين المتضررة (صك ، اصل وثيقة تملك أو وثيقة تملك مؤقتة ، نموذج عقد إيجار ساري المفعول)",
        "صورة وثيقة الملكية اذا كانت العين المتضررة (مركبة - آلية - معدة) والتأكد نمن التأمين",
        " صورة ترخيص مزاولة النشاط أو السجل التجاري أو شهادة الزكاة والدخل والسعودة أذا كانت العين المتضررة محل تجاري",
        "صورة من الوكالة في حال مقدم الطلب وكيل",
      ],
      guideId: "damage_compensation",
    ),
  ];

  int? expandedIndex;

  Future<void> _openPdf(String pdfUrl) async {
    final guidId = await _loadGuideId(pdfUrl);
    final url = '/web/content/$guidId?download=true';
    final uri = Uri.parse('${AppConfig.baseUrl}$url');
    if (await canLaunchUrl(uri)) {
      await launchUrl(uri, mode: LaunchMode.externalApplication);
    } else {
      ScaffoldMessenger.of(
        context,
      ).showSnackBar(const SnackBar(content: Text("تعذر فتح الملف")));
    }
  }

  Future<String?> _loadGuideId(String pdfUrl) async {
    try {
      final guideId = await _odooService.fetchGuideId(pdfUrl);
      if (guideId != null) {
        return guideId;
      }
    } catch (e) {
      print("⚠️ Erreur lors du chargement du guideId: $e");
    }
    return null;
  }

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: NajranScaffold(
        title: "دليل الإجراءات",
        child: ListView.builder(
          itemCount: services.length,
          itemBuilder: (context, index) {
            final service = services[index];
            final isExpanded = expandedIndex == index;

            return Card(
              color: Colors.white,
              margin: const EdgeInsets.symmetric(horizontal: 8, vertical: 0),
              child: ExpansionTile(
                initiallyExpanded: isExpanded,
                title: Row(
                  children: [
                    SvgPicture.asset(
                      "assets/icons/file_add.svg",
                      width: 20,
                      height: 20,
                    ),
                    const SizedBox(width: 8),
                    Expanded(
                      child: Text(
                        service.title,
                        style: const TextStyle(
                          fontWeight: FontWeight.bold,
                          fontSize: 14,
                        ),
                        overflow: TextOverflow.ellipsis,
                      ),
                    ),
                  ],
                ),
                collapsedBackgroundColor: Colors.white,
                backgroundColor: const Color(0xFFE5E7EB),
                tilePadding: const EdgeInsets.symmetric(
                  horizontal: 12,
                  vertical: 0,
                ),
                childrenPadding: EdgeInsets.zero,
                visualDensity: const VisualDensity(vertical: -2),
                onExpansionChanged: (expanded) {
                  setState(() {
                    expandedIndex = expanded ? index : null;
                  });
                },
                children: [
                  Container(
                    color: Colors.white,
                    child: Column(
                      children: [
                        _buildSection("الشروط والأحكام", service.conditions),
                        const Divider(),
                        _buildSection(
                          "الوثائق المطلوب ارفقها",
                          service.documents,
                        ),
                        const SizedBox(height: 10),
                        const Divider(),
                        Padding(
                          padding: const EdgeInsets.symmetric(
                            horizontal: 12,
                            vertical: 8,
                          ),
                          child: Column(
                            children: [
                              SizedBox(
                                width: double.infinity,
                                child: ElevatedButton(
                                  style: ElevatedButton.styleFrom(
                                    backgroundColor: const Color(
                                      0xFF1B8354,
                                    ), // أخضر مثل الصورة
                                    foregroundColor: Colors.white,
                                    padding: const EdgeInsets.symmetric(
                                      vertical: 10,
                                    ),
                                    shape: RoundedRectangleBorder(
                                      borderRadius: BorderRadius.circular(
                                        4,
                                      ), // زوايا خفيفة فقط
                                    ),
                                    elevation: 0, // بدون ظل
                                  ),
                                  onPressed: () {
                                    ScaffoldMessenger.of(context).showSnackBar(
                                      const SnackBar(
                                        content: Text("بدء الخدمة"),
                                      ),
                                    );
                                  },
                                  child: const Text(
                                    "بدء الخدمة",
                                    style: TextStyle(
                                      fontSize: 15,
                                      fontWeight: FontWeight.bold,
                                    ),
                                  ),
                                ),
                              ),
                              const SizedBox(height: 8),
                              SizedBox(
                                width: double.infinity,
                                child: OutlinedButton(
                                  style: OutlinedButton.styleFrom(
                                    padding: const EdgeInsets.symmetric(
                                      vertical: 10,
                                    ),
                                    side: const BorderSide(
                                      color: Colors.grey,
                                    ), // حدود رمادية مثل الصورة
                                    shape: RoundedRectangleBorder(
                                      borderRadius: BorderRadius.circular(4),
                                    ),
                                  ),
                                  onPressed: () {
                                    if (service.guideId != null) {
                                      _openPdf(service.guideId!);
                                    } else {
                                      ScaffoldMessenger.of(
                                        context,
                                      ).showSnackBar(
                                        const SnackBar(
                                          content: Text("لا يوجد دليل متاح"),
                                        ),
                                      );
                                    }
                                  },
                                  child: const Text(
                                    "تحميل دليل الخدمة",
                                    style: TextStyle(
                                      color: Colors.black, // نص أسود مثل الصورة
                                      fontSize: 15,
                                      fontWeight: FontWeight.bold,
                                    ),
                                  ),
                                ),
                              ),
                            ],
                          ),
                        ),
                      ],
                    ),
                  ),
                ],
              ),
            );
          },
        ),
      ),
    );
  }

  Widget _buildSection(String title, List<String>? items) {
    if (items != null) {
      return Padding(
        padding: const EdgeInsets.all(12.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              title,
              style: const TextStyle(
                fontSize: 18,
                fontWeight: FontWeight.w900,
                color: Color(0xFF1B8354),
              ),
            ),
            const SizedBox(height: 8),
            ...items.asMap().entries.map((entry) {
              final index = entry.key + 1;
              final text = entry.value;
              return Padding(
                padding: const EdgeInsets.symmetric(vertical: 4),
                child: Row(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      "$index- ",
                      style: const TextStyle(fontWeight: FontWeight.bold),
                    ),
                    Expanded(
                      child: Text(
                        text,
                        style: TextStyle(fontWeight: FontWeight.bold),
                      ),
                    ),
                  ],
                ),
              );
            }),
          ],
        ),
      );
    }
    return SizedBox();
  }
}
